content/posts/Renormalization_for_Philosophers_by_Butterfield_and_Bouatta_in_2014.md
+++
title = "Renormalization for Philosophers by Butterfield and Bouatta in 2014"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:45-04:00
slug = "Renormalization_for_Philosophers_by_Butterfield_and_Bouatta_in_2014"
draft = false
+++

## [renormalization]({{< relref "renormalization" >}}), [philosophy]({{< relref "philosophy" >}}), [physics]({{< relref "physics" >}}), [papers]({{< relref "papers" >}}) {#renormalization--renormalization-dot-md--philosophy--philosophy-dot-md--physics--physics-dot-md--papers--papers-dot-md}


## 1. Introduction {#1-dot-introduction}


###  {#}


## 2. Renormalization: the traditional approach {#2-dot-renormalization-the-traditional-approach}


### 2.1 Prospectus: corrections needed {#2-dot-1-prospectus-corrections-needed}


### 2.2 Renormalizing a coupling constant {#2-dot-2-renormalizing-a-coupling-constant}

<!--list-separator-->

-  2.2.1 Virtual particles and perturbation theory

<!--list-separator-->

-  2.2.2 Energy scales

<!--list-separator-->

-  2.2.3 Some details


### 2.3 The cut-off introduced {#2-dot-3-the-cut-off-introduced}


### 2.4 Letting the cut-off \\[d\\] go to zero {#2-dot-4-letting-the-cut-off-d-go-to-zero}


### 2.5 The need for extra terms {#2-dot-5-the-need-for-extra-terms}

<!--list-separator-->

-  2.5.1 The physical rationale

<!--list-separator-->

-  2.5.2 A refined definition of renormalizability


### 2.6 Which theories are renormalizable? {#2-dot-6-which-theories-are-renormalizable}

<!--list-separator-->

-  2.6.1 Dyson's criterion

<!--list-separator-->

-  2.6.2 Our good fortune


## 3. The modern approach to renormalization {#3-dot-the-modern-approach-to-renormalization}


### 3.1 Good fortune explained: non-renormalizable terms dwindle at longer distances {#3-dot-1-good-fortune-explained-non-renormalizable-terms-dwindle-at-longer-distances}

<!--list-separator-->

-  3.1.1 Decoupling high-energy behaviour

<!--list-separator-->

-  3.1.2 Spacetime need not be a continuum

<!--list-separator-->

-  3.1.3 Effective theories only?

<!--list-separator-->

-  3.1.4 The renormalization group flow


### 3.2 Short-distance behaviour: the beta-function and asymptotic freedom {#3-dot-2-short-distance-behaviour-the-beta-function-and-asymptotic-freedom}


### 3.3 The perspective from the theory of condensed matter {#3-dot-3-the-perspective-from-the-theory-of-condensed-matter}

<!--list-separator-->

-  3.3.1 Continuous phase transitions: scale-invariance

<!--list-separator-->

-  3.3.2 Critical exponents: the correlation length

<!--list-separator-->

-  3.3.3 Short distances: a natural lower limit


## 4. Nagelian reflections {#4-dot-nagelian-reflections}


### 4.1 Nagel endorsed {#4-dot-1-nagel-endorsed}


### 4.2 Renormalizability deduced at low energies as a family of Nagelian reductions {#4-dot-2-renormalizability-deduced-at-low-energies-as-a-family-of-nagelian-reductions}


### 4.3 Universality as multiple realizability {#4-dot-3-universality-as-multiple-realizability}
